<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"91b31f5adcf364aff32ba602759219de33be5242a843cf578e686450be7c775d","plan_job_ref":"Job Terraform Plan #11 at https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10346101636","plan_out_hash":"7872c63b7a20b8494b6ae3678211a4fe16e5319533169e43e7440763d77cd3f5","plan_hash":"3b9e5ab17f4f6c30192bf249fe938be9cac7dab1b4db7de500fe6b660e3e4399","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __./roots/ecr__
With backend config: `bucket=ileri-tf-state
key=tfstate
region=eu-central-1
`
With variables: `repository_name = "ghactions-test-8404d6be2a3df03a13a90c914bc078886c30062c"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.repository will be created
+   resource "aws_ecr_repository" "repository" {
+       arn                  = (known after apply)
+       force_delete         = true
+       id                   = (known after apply)
+       image_tag_mutability = "IMMUTABLE"
+       name                 = "ghactions-test-8404d6be2a3df03a13a90c914bc078886c30062c"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }
+       tags_all             = {
+           "Environment" = "Dev"
+           "Name"        = "DevOps"
        }

+       encryption_configuration {
+           encryption_type = "KMS"
+           kms_key         = (known after apply)
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #11](https://github.com/Ileriayo/terraform-github-actions-aws/actions/runs/10346101636)